In [1]:
import pandas as pd
import numpy as np

## Data Cleaning for Florida

In [2]:
def file_retrieve_florida(path, year, max_grade, subject):
    df1 = pd.DataFrame()
    if subject == 'english':
        i = 3
        while i <= max_grade:
            df = pd.read_excel(path+year+'/grade_'+str(i)+'_ela.xls')
            df1 = pd.concat([df1,df])
            i += 1
    else:
        i = 3
        while i <= max_grade:
            df = pd.read_excel(path+year+'/'+str(i)+'.xls')
            df1 = pd.concat([df1,df])
            i += 1
            
    return(df1)

In [3]:
### prepare english data ####

path = "C:/Users/ameen/Desktop/Covid_learning_gap_ML_project_17_oct/datasets/florida/english/"

df2017 = file_retrieve_florida(path, "2017", 7, "english")
df2018 = file_retrieve_florida(path, "2018", 7, "english")
df2019 = file_retrieve_florida(path, "2019", 7, "english")
df2021 = file_retrieve_florida(path, "2021", 7, "english")

df2017["year"] = '2017'
df2018["year"] = '2018'
df2019["year"] = '2019'
df2021["year"] = '2021'

In [4]:
print(df2017.shape)
print(df2018.shape)
print(df2019.shape)
print(df2021.shape)

## 2021 has one additional column

(370, 12)
(370, 12)
(370, 12)
(370, 13)

In [5]:
relevant_col = ['year','District Number','District Name','Grade', 'Mean Scale Score ']

df2017 = df2017[relevant_col]
df2018 = df2018[relevant_col]
df2019 = df2019[relevant_col]
df2021 = df2021[relevant_col]

df_flor = pd.concat([df2017,df2018,df2019,df2021])

#df_col.columns = np.array(['year','Level','District_Code','District_Name', 'School_Name','Content', 'Grade','Mean_Scale_Score'])
#df_col.head()

print(df_flor.columns)
print(df_flor.shape)

Index(['year', 'District Number', 'District Name', 'Grade',
       'Mean Scale Score '],
      dtype='object')
(1480, 5)

In [6]:
df = df_flor

for col in df:
    print("couunt of NA values in", col)
    print(df[col].isnull().sum())
    
print(df["Mean Scale Score "].value_counts().sort_values(ascending = False))

### mean scale score has * in it, investigate further

couunt of NA values in year
0
couunt of NA values in District Number
0
couunt of NA values in District Name
0
couunt of NA values in Grade
0
couunt of NA values in Mean Scale Score
0
324    63
323    53
325    51
326    50
320    50
       ..
348     1
345     1
288     1
*       1
282     1
Name: Mean Scale Score , Length: 65, dtype: int64

In [7]:
### remove NAs:
df_flor_fin = df_flor.dropna()
print(df_flor_fin.shape)

for col in df_flor_fin:
    print(df_flor_fin[col].unique())
    
df_flor_fin.info()

(1480, 5)
['2017' '2018' '2019' '2021']
[0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27
 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51
 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 71 72 73 74 75 '00'
 '01' 'd' '03' '04' '05' '06' '07' '08' '09' '10' '11' '12' '13' '14' '15'
 '16' '17' '18' '19' '20' '21' '22' '23' '24' '25' '26' '27' '28' '29'
 '30' '31' '32' '33' '34' '35' '36' '37' '38' '39' '40' '41' '42' '43'
 '44' '45' '46' '47' '48' '49' '50' '51' '52' '53' '54' '55' '56' '57'
 '58' '59' '60' '61' '62' '63' '64' '65' '66' '67' '68' '71' '72' '73'
 '74' '75']
['STATE TOTALS' 'ALACHUA' 'BAKER' 'BAY' 'BRADFORD' 'BREVARD' 'BROWARD'
 'CALHOUN' 'CHARLOTTE' 'CITRUS' 'CLAY' 'COLLIER' 'COLUMBIA' 'DADE'
 'DESOTO' 'DIXIE' 'DUVAL' 'ESCAMBIA' 'FLAGLER' 'FRANKLIN' 'GADSDEN'
 'GILCHRIST' 'GLADES' 'GULF' 'HAMILTON' 'HARDEE' 'HENDRY' 'HERNANDO'
 'HIGHLANDS' 'HILLSBOROUGH' 'HOLMES' 'INDIAN RIVER' 'JACKSON' 'JEFFERSON'
 'LAFAYETTE' 'LAKE' 'LEE' 'LEON' 'LEVY' 'LIBERTY' 'MADISON' 'MANATEE'
 'MARION' 'MARTIN' 'MONROE' 'NASSAU' 'OKALOOSA' 'OKEECHOBEE' 'ORANGE'
 'OSCEOLA' 'PALM BEACH' 'PASCO' 'PINELLAS' 'POLK' 'PUTNAM' 'ST. JOHNS'
 'ST. LUCIE' 'SANTA ROSA' 'SARASOTA' 'SEMINOLE' 'SUMTER' 'SUWANNEE'
 'TAYLOR' 'UNION' 'VOLUSIA' 'WAKULLA' 'WALTON' 'WASHINGTON' 'DEAF/BLIND'
 'FL VIRTUAL' 'FAU LAB SCH' 'FSU LAB SCH' 'FAMU LAB SCH' 'UF LAB SCH'
 'MIAMI-DADE']
[3 4 5 6 7]
[303 305 298 306 302 308 290 300 292 301 293 297 304 299 307 312 295 314
 310 309 274 315 311 313 294 318 317 321 319 316 287 324 323 320 322 325
 326 330 333 328 337 329 327 331 336 332 335 334 338 344 339 342 346 340
 289 296 280 285 348 291 343 345 288 '*' 282]
<class 'pandas.core.frame.DataFrame'>
Int64Index: 1480 entries, 0 to 73
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   year               1480 non-null   object
 1   District Number    1480 non-null   object
 2   District Name      1480 non-null   object
 3   Grade              1480 non-null   int64
 4   Mean Scale Score   1480 non-null   object
dtypes: int64(1), object(4)
memory usage: 69.4+ KB

In [8]:
df_flor_fin.isnull().values.any()

False

In [9]:
### removing entries with no mean scale score
df_flor_fin_1 = df_flor_fin.query("`Mean Scale Score ` != '*'")

print(df_flor_fin.shape)
print(df_flor_fin_1.shape)                              

df_flor_fin_1["Mean Scale Score "] = df_flor_fin_1["Mean Scale Score "].astype(int)
df_flor_fin_1.info()

## around ~3100 entries removed with no average VSS

(1480, 5)
(1479, 5)
<class 'pandas.core.frame.DataFrame'>
Int64Index: 1479 entries, 0 to 73
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   year               1479 non-null   object
 1   District Number    1479 non-null   object
 2   District Name      1479 non-null   object
 3   Grade              1479 non-null   int64
 4   Mean Scale Score   1479 non-null   int32
dtypes: int32(1), int64(1), object(3)
memory usage: 63.6+ KB

C:\Users\ameen\AppData\Local\Temp\ipykernel_21772\3928382269.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_flor_fin_1["Mean Scale Score "] = df_flor_fin_1["Mean Scale Score "].astype(int)

In [10]:
### final table for florida english:
#### it contains for each year, for district, for each grade, for each subject the mean scale scores

df_flor_fin_1_eng = df_flor_fin_1
df_flor_fin_1_eng['subject'] = 'ELA'
df_flor_fin_1_eng.head()

C:\Users\ameen\AppData\Local\Temp\ipykernel_21772\3024612440.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_flor_fin_1_eng['subject'] = 'ELA'

   year District Number District Name  Grade  Mean Scale Score  subject
0  2017               0  STATE TOTALS      3                303     ELA
1  2017               1       ALACHUA      3                303     ELA
2  2017               2         BAKER      3                305     ELA
3  2017               3           BAY      3                303     ELA
4  2017               4      BRADFORD      3                298     ELA

In [11]:
## load data for maths

path = "C:/Users/ameen/Desktop/Covid_learning_gap_ML_project_17_oct/datasets/florida/maths/"

df2017 = file_retrieve_florida(path, "2017", 7, "maths")
df2018 = file_retrieve_florida(path, "2018", 7, "maths")
df2019 = file_retrieve_florida(path, "2019", 7, "maths")
df2021 = file_retrieve_florida(path, "2021", 7, "maths")

df2017["year"] = '2017'
df2018["year"] = '2018'
df2019["year"] = '2019'
df2021["year"] = '2021'

In [12]:
print(df2017.shape)
print(df2018.shape)
print(df2019.shape)
print(df2021.shape)

## 2021 has one additional column

(365, 14)
(365, 12)
(365, 12)
(365, 12)

In [13]:
relevant_col = ['year','District Number','District Name','Grade', 'Mean Scale Score ']

df2017 = df2017[relevant_col]
df2018 = df2018[relevant_col]
df2019 = df2019[relevant_col]
df2021 = df2021[relevant_col]

df_flor = pd.concat([df2017,df2018,df2019,df2021])

#df_col.columns = np.array(['year','Level','District_Code','District_Name', 'School_Name','Content', 'Grade','Mean_Scale_Score'])
#df_col.head()

print(df_flor.columns)
print(df_flor.shape)

Index(['year', 'District Number', 'District Name', 'Grade',
       'Mean Scale Score '],
      dtype='object')
(1460, 5)

In [14]:
df = df_flor

for col in df:
    print("couunt of NA values in", col)
    print(df[col].isnull().sum())
    
print(df["Mean Scale Score "].value_counts().sort_values(ascending = False))

### mean scale score has * in it, investigate further

couunt of NA values in year
0
couunt of NA values in District Number
0
couunt of NA values in District Name
0
couunt of NA values in Grade
0
couunt of NA values in Mean Scale Score
0
321    57
318    53
324    53
317    52
319    51
       ..
349     1
287     1
276     1
273     1
270     1
Name: Mean Scale Score , Length: 72, dtype: int64

In [15]:
### remove NAs:
df_flor_fin = df_flor.dropna()
print(df_flor_fin.shape)

for col in df_flor_fin:
    print(df_flor_fin[col].unique())
    
df_flor_fin.info()

## contains star in mean scale score column

(1460, 5)
['2017' '2018' '2019' '2021']
[ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24
 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48
 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 71 72 73 74
 75]
['ALACHUA' 'BAKER' 'BAY' 'BRADFORD' 'BREVARD' 'BROWARD' 'CALHOUN'
 'CHARLOTTE' 'CITRUS' 'CLAY' 'COLLIER' 'COLUMBIA' 'DADE' 'DESOTO' 'DIXIE'
 'DUVAL' 'ESCAMBIA' 'FLAGLER' 'FRANKLIN' 'GADSDEN' 'GILCHRIST' 'GLADES'
 'GULF' 'HAMILTON' 'HARDEE' 'HENDRY' 'HERNANDO' 'HIGHLANDS' 'HILLSBOROUGH'
 'HOLMES' 'INDIAN RIVER' 'JACKSON' 'JEFFERSON' 'LAFAYETTE' 'LAKE' 'LEE'
 'LEON' 'LEVY' 'LIBERTY' 'MADISON' 'MANATEE' 'MARION' 'MARTIN' 'MONROE'
 'NASSAU' 'OKALOOSA' 'OKEECHOBEE' 'ORANGE' 'OSCEOLA' 'PALM BEACH' 'PASCO'
 'PINELLAS' 'POLK' 'PUTNAM' 'ST. JOHNS' 'ST. LUCIE' 'SANTA ROSA'
 'SARASOTA' 'SEMINOLE' 'SUMTER' 'SUWANNEE' 'TAYLOR' 'UNION' 'VOLUSIA'
 'WAKULLA' 'WALTON' 'WASHINGTON' 'DEAF/BLIND' 'FL VIRTUAL' 'FAU LAB SCH'
 'FSU LAB SCH' 'FAMU LAB SCH' 'UF LAB SCH' 'MIAMI-DADE']
[3 4 5 6 7]
[302 307 299 297 305 306 304 291 298 295 303 300 301 308 292 296 312 311
 278 294 310 313 317 316 314 318 319 320 315 322 324 323 326 321 309 284
 328 325 333 337 331 329 330 327 285 334 332 336 345 339 335 338 340 348
 288 293 273 276 287 341 346 342 349 344 290 281 347 351 286 289 '*' 270]
<class 'pandas.core.frame.DataFrame'>
Int64Index: 1460 entries, 0 to 72
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   year               1460 non-null   object
 1   District Number    1460 non-null   int64
 2   District Name      1460 non-null   object
 3   Grade              1460 non-null   int64
 4   Mean Scale Score   1460 non-null   object
dtypes: int64(2), object(3)
memory usage: 68.4+ KB

In [16]:
df_flor_fin.isnull().values.any()

False

In [17]:
### removing entries with no mean scale score
df_flor_fin_1 = df_flor_fin.query("`Mean Scale Score ` != '*'")

print(df_flor_fin.shape)
print(df_flor_fin_1.shape)                              

df_flor_fin_1["Mean Scale Score "] = df_flor_fin_1["Mean Scale Score "].astype(int)
df_flor_fin_1.info()

(1460, 5)
(1458, 5)
<class 'pandas.core.frame.DataFrame'>
Int64Index: 1458 entries, 0 to 72
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   year               1458 non-null   object
 1   District Number    1458 non-null   int64
 2   District Name      1458 non-null   object
 3   Grade              1458 non-null   int64
 4   Mean Scale Score   1458 non-null   int32
dtypes: int32(1), int64(2), object(2)
memory usage: 62.6+ KB

C:\Users\ameen\AppData\Local\Temp\ipykernel_21772\2876576195.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_flor_fin_1["Mean Scale Score "] = df_flor_fin_1["Mean Scale Score "].astype(int)

In [18]:
### final table for florida english:
#### it contains for each year, for district, for each grade, for each subject the mean scale scores

df_flor_fin_1_maths = df_flor_fin_1
df_flor_fin_1_maths['subject'] = 'Maths'
df_flor_fin_1_maths.head()

C:\Users\ameen\AppData\Local\Temp\ipykernel_21772\329708612.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_flor_fin_1_maths['subject'] = 'Maths'

   year  District Number District Name  Grade  Mean Scale Score  subject
0  2017                1       ALACHUA      3                302   Maths
1  2017                2         BAKER      3                307   Maths
2  2017                3           BAY      3                299   Maths
3  2017                4      BRADFORD      3                297   Maths
4  2017                5       BREVARD      3                302   Maths

In [19]:
## final table for florida
## year wise, distrcit wist, grade wise, subject wise 

df_flor_fin_1 = pd.concat([df_flor_fin_1_maths,df_flor_fin_1_eng])
print(df_flor_fin_1.shape)

df_flor_fin_1.to_csv('C:/Users/ameen/Desktop/Covid_learning_gap_ML_project_17_oct/datasets_processed/florida.csv')
df_flor_fin_1.head()

(2937, 6)

   year District Number District Name  Grade  Mean Scale Score  subject
0  2017               1       ALACHUA      3                302   Maths
1  2017               2         BAKER      3                307   Maths
2  2017               3           BAY      3                299   Maths
3  2017               4      BRADFORD      3                297   Maths
4  2017               5       BREVARD      3                302   Maths